[{"test_case":"﻿Verify that cursor is focused on the “Username” text box on the page load (login page)\r"},{"test_case":"Verify that the login screen contains elements such as Username, Password, Sign in button, Remember password check box, Forgot password link, and create an account link.\r"},{"test_case":"Verify that tab functionality is working properly or not\r"},{"test_case":"Verify that Enter/Tab key works as a substitute for the Sign-in button\r"},{"test_case":"Verify that all the fields such as Username, Password has a valid placeholder\r"},{"test_case":"Verify whether all the text boxes have a minimum and maximum length.\r"},{"test_case":"Verify that the labels float upward when the text field is in focus or filled (In case of the floating label)\r"},{"test_case":"Verify that the User is able to Login with Valid Credentials\r"},{"test_case":"Verify that the User is not able to Login with an invalid Username and invalid Password\r"},{"test_case":"Verify that the User is not able to Login with a Valid Username and invalid Password\r"},{"test_case":"Verify that the User is not able to log in with an invalid Username and Valid Password\r"},{"test_case":"Verify that the User is not able to log in with a blank Username or Password\r"},{"test_case":"Verify that the User is not able to Login with inactive credentials\r"},{"test_case":"Verify that the reset button clears the data from all the text boxes in the login form\r"},{"test_case":"Verify that the login credentials, mainly password stores in a database in an encrypted format\r"},{"test_case":"Verify that clicking on the browser back button after successful login should not take the User to log out mode\r"},{"test_case":"Verify that clicking on the browser back button after successful logout should not take the User to a logged-in mode\r"},{"test_case":"Verify that there is a limit on the total number of unsuccessful login attempts (No. of invalid attempts should be based on business logic. Based on the business logic, User will be asked to enter the captcha and try again or user will be blocked)\r"},{"test_case":"Verify that the password is in encrypted form  (masked format) when entered\r"},{"test_case":"Verify the password can be copy-pasted. System shouldn’t allow users to copy paste password.\r"},{"test_case":"Verify that encrypted characters in the “Password” field should not allow deciphering if copied\r"},{"test_case":"Verify that the User should be able to login with the new password after changing the password\r"},{"test_case":"Verify that the user should not be able to login with the old password after changing the password\r"},{"test_case":"Verify that spaces should not be allowed before any password characters attempted\r"},{"test_case":"Verify whether the user is still logged in after a series of actions such as sign-in, close the browser, and reopen the application.\r"},{"test_case":"Verify that the ways to retrieve the password if the user forgets the password\r"},{"test_case":"Verify that the “Remember password” checkbox is unselected by default (depends on business logic, it may be selected or unselected)\r"},{"test_case":"Verify that the “Keep me logged in” checkbox is unselected by default (depends on business logic, it may be selected or unselected)\r"},{"test_case":"Verify that the timeout of the login session (Session Timeout)\r"},{"test_case":"Verify that the logout link is redirected to login/home page\r"},{"test_case":"Verify that User is redirected to appropriate page after successful login\r"},{"test_case":"Verify that the User is redirected to the Forgot password page when clicking on the Forgot Password link\r"},{"test_case":"Verify that the User is redirected to the Create an account page when clicking on the Signup / Create an account link\r"},{"test_case":"Verify that validation message is displayed in the case when User leaves Username or Password as blank\r"},{"test_case":"Verify that validation message is displayed in case of exceeding the character limit of the Username and Password fields\r"},{"test_case":"Verify that validation message is displayed in case of entering special character in the Username and password fields\r"},{"test_case":"Verify whether the login form is revealing any security information by viewing the page source\r"},{"test_case":"Verify that the login page is vulnerable to SQL injection\r"},{"test_case":"Verify whether Cross-site scripting (XSS ) vulnerability works on a login page. XSS vulnerability may be used by hackers to bypass access controls."}]